# Portable CLI base for Linux and macOS.

# Bootstrap essentials: make the machine usable before heavier packages run.
brew "git"
brew "make"
brew "python"
brew "curl"
brew "wget"
brew "unzip"
brew "xz"
brew "jq"
brew "bash"
brew "bash-completion@2"
brew "zsh"
brew "gh"
brew "starship"
brew "stow"

# Build basics.
brew "cmake"
brew "ninja"
brew "pkgconf"

# Daily CLI tools.
brew "tree"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "bat"
brew "duf"
brew "ncdu"
brew "tmux"
brew "fastfetch"

# Editor tooling.
brew "neovim"
brew "tree-sitter-cli"
brew "lua"
brew "stylua"
brew "lazydocker"

# Language/package managers.
brew "uv"
brew "fnm"
brew "pnpm"
brew "rustup-init"

# Heavier toolchains and dependency-heavy formulas.
brew "go"
brew "zig"
brew "juliaup"
brew "llvm"
brew "openjdk"
brew "gradle"
brew "btop" # Pulls gcc/binutils on Linuxbrew.
